In [1]:
import pandas as pd

In [6]:
dict_data = {'c0' : [1,2,3],
'c1' : [4,5,6],
'c2' : [7,8,9],
'c3' : [10,11,12],
'c4' : [13,14,15]}

In [7]:
df = pd.DataFrame(dict_data)

In [8]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [9]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
pd.DataFrame(dict_data, columns=['c0','c1'])

   c0  c1
0   1   4
1   2   5
2   3   6

In [12]:
pd.DataFrame(dict_data, columns=['c0','c1','c2','c3','c4','debt'])

   c0  c1  c2  c3  c4 debt
0   1   4   7  10  13  NaN
1   2   5   8  11  14  NaN
2   3   6   9  12  15  NaN

In [15]:
pd.DataFrame(dict_data, columns=['a','b'])

Empty DataFrame
Columns: [a, b]
Index: []

In [30]:
df = pd.DataFrame([[15,'남','덕영중'],
                   [17,'여','수리중']], 
                  index = ['준서', '예은'], 
                  columns=['나이', '성별', '학교'])

In [29]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [20]:
print(df.index)

Index(['준서', '예은'], dtype='object')

In [21]:
print(df.columns)

Index(['나이', '성별', '학교'], dtype='object')

In [45]:
df.index = ['학생1', '학생2']
df.columns = ['연령', '남여', '소속']

In [46]:
df

     연령 남여   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [54]:
df.rename(index={'학생1':'준서','학생2':'예은'}, inplace=True)

In [52]:
df.rename(columns={'연령':'나이','남여':'성별','소속':'학교'})

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [56]:
print(df)

    연령 남여   소속
준서  15  남  덕영중
예은  17  여  수리중

In [55]:
df

    연령 남여   소속
준서  15  남  덕영중
예은  17  여  수리중

In [57]:
df.rename({'소속':'학교'}, axis=0)

    연령 남여   소속
준서  15  남  덕영중
예은  17  여  수리중

In [60]:
df.rename({'소속':'학교'}, axis=1)

    연령 남여   학교
준서  15  남  덕영중
예은  17  여  수리중

In [64]:
df

    연령 남여   소속
준서  15  남  덕영중
예은  17  여  수리중

In [65]:
df.rename({'소속':'학교'}, axis=1, inplace=True)

In [66]:
df

    연령 남여   학교
준서  15  남  덕영중
예은  17  여  수리중

In [75]:
exam_data = {'수학':[90,80,70],
             '영어':[98,89,95],
             '음악':[85,95,100],
             '체육':[100,90,90]}

In [77]:
df = pd.DataFrame(exam_data, 
                  index=['서준', '우현', '인아'])

In [78]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [71]:
df.drop('우현', axis=0)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [73]:
df.drop(['우현','인아'], axis=0)

    수학  영어  음악   체육
서준  90  98  85  100

In [79]:
df2 = df.copy()

In [81]:
df2.drop(['우현','인아'], axis=0, inplace=True)

In [82]:
df2

    수학  영어  음악   체육
서준  90  98  85  100

In [83]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [84]:
df3 = df.copy()

In [89]:
df3.drop('수학', axis=1, inplace=True)

In [90]:
df3

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [91]:
df4 = df.copy()

In [92]:
df4.drop(['영어','음악'], axis=1, inplace=True)

In [93]:
df4

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [96]:
df['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [127]:
df[['수학','음악']]

    수학   음악
서준  90   85
우현  80   95
인아  70  100

In [117]:
df.loc[['서준']]

    수학  영어  음악   체육
서준  90  98  85  100

In [130]:
df.loc['서준':'인아']

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [118]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [124]:
df.iloc[[0,2]]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [129]:
df.iloc[[0,2]]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [135]:
df = pd.DataFrame(exam_data, d)

In [263]:
df = pd.DataFrame(exam_data, 
                  index=['서준', '우현', '인아'],
                 columns=['수학', '영어', '음악', '체육'])

In [264]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [171]:
df.loc['서준']['음악']

85

In [172]:
df.loc['서준']['음악': '체육']

음악     85
체육    100
Name: 서준, dtype: int64

In [173]:
df.iloc[0]['음악':'체육']

음악     85
체육    100
Name: 서준, dtype: int64

In [174]:
df['음악']['서준']

85

In [175]:
df6 = df.copy()

In [176]:
df6.loc['서준','음악']

85

In [177]:
df6.iloc[0,2]

85

In [178]:
df6.loc['서준',['음악','체육']]

음악     85
체육    100
Name: 서준, dtype: int64

In [179]:
df6.loc[['서준'],['음악','체육']]

    음악   체육
서준  85  100

In [180]:
df6.iloc[0,[2,3]]

음악     85
체육    100
Name: 서준, dtype: int64

In [181]:
df6.iloc[0, 2:]

음악     85
체육    100
Name: 서준, dtype: int64

In [182]:
df6.loc['서준','음악':]

음악     85
체육    100
Name: 서준, dtype: int64

In [187]:
df6.loc[['서준','우현'],['음악','체육']]

    음악   체육
서준  85  100
우현  95   90

In [189]:
df6.iloc[:2, 2:]

    음악   체육
서준  85  100
우현  95   90

In [190]:
df6.loc[['서준','우현'],'음악':'체육']

    음악   체육
서준  85  100
우현  95   90

In [200]:
df.drop('국어', axis=1, inplace=True)

In [201]:
df7 = df.copy()

In [202]:
df7 ['국어'] = 80

In [204]:
df7

    수학  영어   음악   체육  국어
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [205]:
df8 = df.copy()

In [209]:
df8.loc[3] = 0

In [211]:
df8.drop(2, inplace=True)

In [212]:
df8

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
3    0   0    0    0

In [213]:
df8.loc['행5'] = df8.loc[3]

In [214]:
df8

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
3    0   0    0    0
행5   0   0    0    0

In [215]:
df8.drop('행5', inplace=True)

In [217]:
df8.loc['동규'] = [90,80,70,60]

In [218]:
df8

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
3    0   0    0    0
동규  90  80   70   60

In [220]:
df8.loc['행5'] = df8.loc[3]

In [221]:
df8

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
3    0   0    0    0
동규  90  80   70   60
행5   0   0    0    0

In [222]:
df8.loc[3]

수학    0
영어    0
음악    0
체육    0
Name: 3, dtype: int64

In [223]:
df6

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [225]:
df6.iloc[0,3] = 80

In [226]:
df6

    수학  영어   음악  체육
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [228]:
df6.loc['서준','체육'] = 90

In [229]:
df6

    수학  영어   음악  체육
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [233]:
df6.loc['서준']['체육'] = 80

In [234]:
df6

    수학  영어   음악  체육
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [237]:
df6.iloc[0][3] = 100

In [238]:
df6

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [239]:
df6.loc['서준',['음악','체육']]

음악     85
체육    100
Name: 서준, dtype: int64

In [242]:
df6.loc['서준',['음악','체육']] = 50

In [243]:
df6

    수학  영어   음악  체육
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [250]:
df6.loc['서준',['음악','체육']] = 90,60

In [251]:
df6

    수학  영어   음악  체육
서준  90  98   90  60
우현  80  89   95  90
인아  70  95  100  90

In [252]:
df.transpose()

     서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [254]:
df.T

     서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [255]:
df.transpose().T

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [257]:
exam_data1 = {'이름':['서준', '우현','인아'],
             '수학':[90,80,70],
             '영어':[98,89,95],
             '음악':[85,95,100],
             '체육':[100,90,90]}

In [265]:
df = pd.DataFrame(exam_data1)

In [268]:
ndf = df.set_index('이름')

In [269]:
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [272]:
ndf2 = ndf.set_index(['음악'])

In [279]:
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [277]:
ndf3 = ndf2.set_index(['수학','체육'])

In [278]:
ndf3

        영어
수학 체육
90 100  98
80 90   89
70 90   95

In [280]:
dict_data = {'c0' : [1,2,3],
             'c1' : [4,5,6],
             'c2' : [7,8,9],
             'c3' : [10,11,12],
             'c4' : [13,14,15]}

In [282]:
df = pd.DataFrame(dict_data,
                 index=['r0','r1','r2'])

In [283]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [285]:
ndf = df.reindex(['r0','r1','r2','r3','r4'])

In [296]:
ndf.iloc[[3,4]] = 0

In [295]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  0.0  0.0  0.0   0.0   0.0
r4  0.0  0.0  0.0   0.0   0.0

In [297]:
ndf1 = df.reindex(['r2', 'r1'])

In [298]:
ndf1

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14

In [299]:
ndf2 = df.reset_index()

In [300]:
ndf2

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [314]:
df.sort_index(axis=0, ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [312]:
df.sort_index(axis=0, ascending=True)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [316]:
a = {'ascending':False}
df.sort_index(**a)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [317]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [323]:
df.sort_values(['c1'], ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [325]:
df.sort_values(by = 'c1', ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

# 판다스 객체 산술연산의 내부 3단계 프로세스

In [327]:
student1 = pd.Series({'국어':100,'영어':80,'수학':90})

In [329]:
student1/200

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [366]:
student1 = pd.Series({'국어':100,'영어':80,'수학':90})
student2 = pd.Series({'수학':80, '국어':90,'영어':80})

In [367]:
addition = student1 + student2

In [368]:
subtraction = student1 - student2

In [369]:
multiplication = student1 * student2

In [370]:
division = student1 / student2

In [338]:
print('addition = \n', addition)
print('subtraction = \n', subtraction)
print('multiplication = \n', multiplication)
print('division = \n', division)

addition =
 국어    190
수학    170
영어    160
dtype: int64
subtraction =
 국어    10
수학    10
영어     0
dtype: int64
multiplication =
 국어    9000
수학    7200
영어    6400
dtype: int64
division =
 국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [371]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
            index=['덧셈','뺄셈','곱셈','나눗셈'])

In [372]:
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [383]:
import numpy as np
student1 = pd.Series({'국어': np.nan, '영어':80,'수학':90})
student2 = pd.Series({'수학':80,'국어': 90})

In [391]:
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

In [380]:
result2 = pd.DataFrame([addition, subtraction, multiplication, division],
            index=['덧셈','뺄셈','곱셈','나눗셈'])

In [381]:
result2

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [393]:
sr_add = student1.add(student2,fill_value=0)
sr_sub = student1.subtract(student2,fill_value=0)
sr_mul = student1.multiply(student2,fill_value=0)
sr_div = student1.divide(student2,fill_value=0)

In [394]:
result3 = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
            index=['덧셈','뺄셈','곱셈','나눗셈'])

In [395]:
result3

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [396]:
### 위에서 inf는 무한대

In [397]:
import seaborn as sns

In [398]:
titanic = sns.load_dataset('titanic')

In [402]:
age_fare = titanic[['age','fare']]

In [404]:
age_fare

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [407]:
addition = age_fare + 10

In [409]:
addition - age_fare

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]

# 데이터 입출력

In [410]:
file_path = '/Users/iseung-won/read_csv_sample.csv'

In [417]:
df1 = pd.read_csv(file_path)

In [418]:
df2 = pd.read_csv(file_path, header=None)

In [419]:
df3 = pd.read_csv(file_path, index_col=None)

In [420]:
df4 = pd.read_csv(file_path, index_col='c0')

In [421]:
df1

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [422]:
df2

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [423]:
df3

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [424]:
df4

    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9

In [425]:
file_path1 = './남북한발전전력량.xlsx'

In [429]:
nsdf = pd.read_excel(file_path1)

In [430]:
nsdf

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [431]:
nsdf1 = pd.read_excel(file_path1, header=0)

In [432]:
nsdf1

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [433]:
nsdf2 = pd.read_excel(file_path1, header=None)

In [434]:
nsdf2

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,28
0,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
1,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
2,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
3,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
4,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
5,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
6,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
7,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
8,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
9,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [435]:
file_path2 = './read_json_sample.json'

In [441]:
jdf = pd.read_json(file_path2)
jdf

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

In [438]:
jdf.index

Index(['pandas', 'NumPy', 'matplotlib'], dtype='object')

In [439]:
jdf.columns

Index(['name', 'year', 'developer', 'opensource'], dtype='object')

In [442]:
jdf.iloc[:]

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

In [443]:
jdf.set_index('name')

      year        developer opensource
name
      2008    Wes Mckinneye       True
      2006  Travis Oliphant       True
      2003   John D. Hunter       True

In [444]:
jdf['name']

pandas
NumPy
matplotlib
Name: name, dtype: object

In [445]:
jdf['year']

pandas        2008
NumPy         2006
matplotlib    2003
Name: year, dtype: int64

In [448]:
url = "/Users/iseung-won/sample.html"

In [450]:
hdf = pd.read_html(url)

In [451]:
hdf

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [458]:
hdf[0]

   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9

In [457]:
hdf[1]

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [459]:
hdf1 = hdf[1]

In [460]:
hdf1['name']

0         NumPy
1    matplotlib
2        pandas
Name: name, dtype: object

In [461]:
hdf1.set_index('name')

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

In [462]:
for i in range(len(hdf)):
    print(hdf[i])

   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9
         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [ ]:
del

In [482]:
from bs4 import BeautifulSoup
from selenium import webdriver
import time, sys
driver = webdriver.Safari()
driver.get("https://korean.visitkorea.or.kr/main/main.html")
driver.maximize_window()
time.sleep(2)
driver.find_element_by_id("inp_search").click()
element = driver.find_element_by_id("inp_search")
time.sleep(2)
element.send_keys('가을여행')
time.sleep(2)
enter = webdriver.Keys.ENTER
element.send_keys(enter)
time.sleep(2)
html = driver.page_source
soup = BeautifulSoup(html, 'html.parser')
content_list = soup.find('ul', class_='list_thumType type1')

/var/folders/fl/lytw3yqx5913yh2tcxgw3d740000gn/T/ipykernel_1055/3924992859.py:7: DeprecationWarning: find_element_by_* commands are deprecated. Please use find_element() instead
  driver.find_element_by_id("inp_search").click()
/var/folders/fl/lytw3yqx5913yh2tcxgw3d740000gn/T/ipykernel_1055/3924992859.py:8: DeprecationWarning: find_element_by_* commands are deprecated. Please use find_element() instead
  element = driver.find_element_by_id("inp_search")

In [483]:
content_list

<ul class="list_thumType type1"><li><div class="photo"><a href="javascript:goSearchDetail('701f7dc2-d810-492f-967e-b602b3ffa7df');"> <img alt="[소도시 낭만 여행, 마이리틀시티] 9탄 &lt;br&gt;때묻지 않은 자연을 품은 의령에서 맞이한 가을" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=32a5afad-c4fd-4da3-844a-d0093adee59c"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('701f7dc2-d810-492f-967e-b602b3ffa7df');"><em></em>[소도시 낭만 <!--HS-->여행<!--HE-->, 마이리틀시티] 9탄 <br/>때묻지 않은 자연을 품은 의령에서 맞이한 <!--HS-->가을<!--HE--></a> </div> <div class="service"> <p>경상남도 의령군</p> <ul class="brandingIcon" id="branding_701f7dc2-d810-492f-967e-b602b3ffa7df"> </ul> </div> <p class="tag_type"><span>#<em></em>의령여행</span><span>#<em></em>의령가볼만한곳</span><span>#<em></em>소도시여행</span><span>#<em></em><em>가을여행</em></span><span>#<em></em>호국의병의숲</span><span>#<em></em>일붕사</span><span>#<em></em>의령구름다리</span><span>#<em></em>구름다리</span><span>#<em></em>의령천</span><span>#<em></em>공공누리</span><span>#<em></em>마이리틀시티</span><span>#<em></em>2022_추석_당일치기_여행</span> </p></div><button class="btn_view" onclick='viewClick("701f7dc2-d810-492f-967e-b602b3ffa7df")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("701f7dc2-d810-492f-967e-b602b3ffa7df")'>즐겨찾기</a></li> <li class="btn_share" id="701f7dc2-d810-492f-967e-b602b3ffa7df"><a href="javascript:" onclick='getShareInfo("%5B%EC%86%8C%EB%8F%84%EC%8B%9C%20%EB%82%AD%EB%A7%8C%20%3C!HS%3E%EC%97%AC%ED%96%89%3C!HE%3E%2C%20%EB%A7%88%EC%9D%B4%EB%A6%AC%ED%8B%80%EC%8B%9C%ED%8B%B0%5D%209%ED%83%84%20%3Cbr%3E%EB%95%8C%EB%AC%BB%EC%A7%80%20%EC%95%8A%EC%9D%80%20%EC%9E%90%EC%97%B0%EC%9D%84%20%ED%92%88%EC%9D%80%20%EC%9D%98%EB%A0%B9%EC%97%90%EC%84%9C%20%EB%A7%9E%EC%9D%B4%ED%95%9C%20%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E","32a5afad-c4fd-4da3-844a-d0093adee59c","701f7dc2-d810-492f-967e-b602b3ffa7df","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('fd0f828e-11f8-428b-b067-5fd039d1be6d');"> <img alt="색깔별로 떠나는 가을 꽃 여행" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=0cc0acb1-d334-46e9-b0b5-a73a7ae4bb61"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('fd0f828e-11f8-428b-b067-5fd039d1be6d');"><em></em>색깔별로 떠나는 <!--HS-->가을<!--HE--> 꽃 <!--HS-->여행<!--HE--></a> </div> <div class="service"> <p>전국 </p> <ul class="brandingIcon" id="branding_fd0f828e-11f8-428b-b067-5fd039d1be6d"> </ul> </div> <p class="tag_type"><span>#<em></em>가을꽃여행</span><span>#<em></em><em>가을여행</em></span><span>#<em></em>꽃여행</span><span>#<em></em>단풍여행</span><span>#<em></em>갈대</span><span>#<em></em>댑싸리</span><span>#<em></em>코스모스</span><span>#<em></em>핑크뮬리</span><span>#<em></em>꽃무릇</span><span>#<em></em>칠면초</span><span>#<em></em>팜파스</span><span>#<em></em>해국</span><span>#<em></em>천일홍</span><span>#<em></em>아스타국화</span><span>#<em></em>테마여행</span> </p></div><button class="btn_view" onclick='viewClick("fd0f828e-11f8-428b-b067-5fd039d1be6d")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("fd0f828e-11f8-428b-b067-5fd039d1be6d")'>즐겨찾기</a></li> <li class="btn_share" id="fd0f828e-11f8-428b-b067-5fd039d1be6d"><a href="javascript:" onclick='getShareInfo("%EC%83%89%EA%B9%94%EB%B3%84%EB%A1%9C%20%EB%96%A0%EB%82%98%EB%8A%94%20%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%20%EA%BD%83%20%3C!HS%3E%EC%97%AC%ED%96%89%3C!HE%3E","0cc0acb1-d334-46e9-b0b5-a73a7ae4bb61","fd0f828e-11f8-428b-b067-5fd039d1be6d","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('e2f84681-7318-4fea-9072-37bb8b3480a5');"> <img alt="내게 온 영주와 떠나는 가을 랜선 여행, &lt;br&gt;'내게 와, 영주!'" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=8be1f7b8-954f-43c5-88c4-e0bc0a70016c"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('e2f84681-7318-4fea-9072-37bb8b3480a5');"><em></em>내게 온 영주와 떠나는 <!--HS-->가을<!--HE--> 랜선 <!--HS-->여행<!--HE-->, <br/>'내게 와, 영주!'</a> </div> <div class="service"> <p>경상북도 영주시</p> <ul class="brandingIcon" id="branding_e2f84681-7318-4fea-9072-37bb8b3480a5"> </ul> </div> <p class="tag_type"><span>#<em></em>영주여행</span><span>#<em></em>영주가볼만한곳</span><span>#<em></em>만수주조</span><span>#<em></em>발효체험학교</span><span>#<em></em>발효체험학교띄움</span><span>#<em></em>소백산꽃차이야기</span><span>#<em></em>체험프로그램</span><span>#<em></em>체험여행</span><span>#<em></em>꽃차</span><span>#<em></em>부석사</span><span>#<em></em>영주부석사</span><span>#<em></em>부석사(영주)</span><span>#<em></em>무량수전</span><span>#<em></em>소수서원</span><span>#<em></em>영주선비촌</span><span>#<em></em>선비촌</span><span>#<em></em><em>가을여행</em></span><span>#<em></em>랜선여행</span> </p></div><button class="btn_view" onclick='viewClick("e2f84681-7318-4fea-9072-37bb8b3480a5")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("e2f84681-7318-4fea-9072-37bb8b3480a5")'>즐겨찾기</a></li> <li class="btn_share" id="e2f84681-7318-4fea-9072-37bb8b3480a5"><a href="javascript:" onclick='getShareInfo("%EB%82%B4%EA%B2%8C%20%EC%98%A8%20%EC%98%81%EC%A3%BC%EC%99%80%20%EB%96%A0%EB%82%98%EB%8A%94%20%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%20%EB%9E%9C%EC%84%A0%20%3C!HS%3E%EC%97%AC%ED%96%89%3C!HE%3E%2C%20%3Cbr%3E%26%2339%3B%EB%82%B4%EA%B2%8C%20%EC%99%80%2C%20%EC%98%81%EC%A3%BC!%26%2339%3B","8be1f7b8-954f-43c5-88c4-e0bc0a70016c","e2f84681-7318-4fea-9072-37bb8b3480a5","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('eba37f2f-cd0e-4326-9dc6-12e7fe3036de');"> <img alt="9월 청청한 한가위, DMZ으로 떠나는 가을여행" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=5c39f41e-de9b-425d-96f6-cf07eab0639a"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('eba37f2f-cd0e-4326-9dc6-12e7fe3036de');"><em></em>9월 청청한 한가위, DMZ으로 떠나는 <!--HS--><em>가을여행</em><!--HE--></a> </div> <div class="service"> <p></p> <ul class="brandingIcon" id="branding_eba37f2f-cd0e-4326-9dc6-12e7fe3036de"> </ul> </div> <p class="tag_type"><span>#<em></em><em>가을여행</em></span><span>#<em></em>DMZ</span><span>#<em></em>DMZ테마</span><span>#<em></em>DMZ테마여행</span> </p></div><button class="btn_view" onclick='viewClick("eba37f2f-cd0e-4326-9dc6-12e7fe3036de")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("eba37f2f-cd0e-4326-9dc6-12e7fe3036de")'>즐겨찾기</a></li> <li class="btn_share" id="eba37f2f-cd0e-4326-9dc6-12e7fe3036de"><a href="javascript:" onclick='getShareInfo("9%EC%9B%94%20%EC%B2%AD%EC%B2%AD%ED%95%9C%20%ED%95%9C%EA%B0%80%EC%9C%84%2C%20DMZ%EC%9C%BC%EB%A1%9C%20%EB%96%A0%EB%82%98%EB%8A%94%20%3C!HS%3E%EA%B0%80%EC%9D%84%EC%97%AC%ED%96%89%3C!HE%3E","5c39f41e-de9b-425d-96f6-cf07eab0639a","eba37f2f-cd0e-4326-9dc6-12e7fe3036de","304");'>공유하기</a></li> </ul></div></li><li class="banner_area"> <div class="pc"> <a class="banner0" href="https://korean.visitkorea.or.kr/detail/event_detail.do?cotid=d80c2c04-6e0c-4b9f-be9c-f08be21a120a"><span><img alt="'당신의 최애 맛집은?' 최애 맛집 제보 이벤트" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=92425982-5493-4c9c-bb21-4d572ccf64a9"/></span></a> <a class="banner1" href="https://korean.visitkorea.or.kr/trss/applyintro.do?utm_source=main_showcase"><span><img alt="핫플 정기 배송! 가볼래-터 구독하고 여행 선물 받자!" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=959affcc-254d-4161-accb-559b39336b26"/></span></a> </div></li><li><div class="photo"><a href="javascript:goSearchDetail('e2ab2a74-fe55-4c81-82dd-946b6d023d50');"> <img alt="대구 도심 속 보석 같은 가을 여행지, 대명유수지와 달성습지" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=5539d646-0500-4c1a-a709-9d14decec70f"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('e2ab2a74-fe55-4c81-82dd-946b6d023d50');"><em></em>대구 도심 속 보석 같은 <!--HS-->가을<!--HE--> <!--HS-->여행<!--HE-->지, 대명유수지와 달성습지</a> </div> <div class="service"> <p>대구 달서구</p> <ul class="brandingIcon" id="branding_e2ab2a74-fe55-4c81-82dd-946b6d023d50"> </ul> </div> <p class="tag_type"><span>#<em></em>2021가을시즌비대면안심관광지25선</span><span>#<em></em>2021비대면안심관광지</span><span>#<em></em>비대면안심관광지</span><span>#<em></em>비대면_안심관광지</span><span>#<em></em>가을_비대면관광지</span><span>#<em></em>대구여행</span><span>#<em></em>대구가볼만한곳</span><span>#<em></em><em>가을여행</em></span><span>#<em></em>억새군락지</span><span>#<em></em>억새</span><span>#<em></em>대명유수지</span><span>#<em></em>달성습지</span><span>#<em></em>생태탐방로</span><span>#<em></em>경상권_비대면관광지</span><span>#<em></em>자연과함께</span> </p></div><button class="btn_view" onclick='viewClick("e2ab2a74-fe55-4c81-82dd-946b6d023d50")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("e2ab2a74-fe55-4c81-82dd-946b6d023d50")'>즐겨찾기</a></li> <li class="btn_share" id="e2ab2a74-fe55-4c81-82dd-946b6d023d50"><a href="javascript:" onclick='getShareInfo("%EB%8C%80%EA%B5%AC%20%EB%8F%84%EC%8B%AC%20%EC%86%8D%20%EB%B3%B4%EC%84%9D%20%EA%B0%99%EC%9D%80%20%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%20%3C!HS%3E%EC%97%AC%ED%96%89%3C!HE%3E%EC%A7%80%2C%20%EB%8C%80%EB%AA%85%EC%9C%A0%EC%88%98%EC%A7%80%EC%99%80%20%EB%8B%AC%EC%84%B1%EC%8A%B5%EC%A7%80","5539d646-0500-4c1a-a709-9d14decec70f","e2ab2a74-fe55-4c81-82dd-946b6d023d50","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('93e5bce7-5557-4c51-8386-f7754839131d');"> <img alt="2000배 더 즐거운 이천 가을여행" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=a0aa7dda-1a3b-455d-8d32-b1b9a23d5e00"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('93e5bce7-5557-4c51-8386-f7754839131d');"><em></em>2000배 더 즐거운 이천 <!--HS--><em>가을여행</em><!--HE--></a> </div> <div class="service"> <p>경기도 이천시</p> <ul class="brandingIcon" id="branding_93e5bce7-5557-4c51-8386-f7754839131d"> </ul> </div> <p class="tag_type"><span>#<em></em>이천여행</span><span>#<em></em>이천가볼만한곳</span><span>#<em></em>당일치기여행</span><span>#<em></em>예스파크</span><span>#<em></em>시몬스테라스</span><span>#<em></em>티하우스에덴</span><span>#<em></em>설봉호수</span><span>#<em></em>별빛정원우주</span><span>#<em></em>경기도당일코스</span> </p></div><button class="btn_view" onclick='viewClick("93e5bce7-5557-4c51-8386-f7754839131d")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("93e5bce7-5557-4c51-8386-f7754839131d")'>즐겨찾기</a></li> <li class="btn_share" id="93e5bce7-5557-4c51-8386-f7754839131d"><a href="javascript:" onclick='getShareInfo("2000%EB%B0%B0%20%EB%8D%94%20%EC%A6%90%EA%B1%B0%EC%9A%B4%20%EC%9D%B4%EC%B2%9C%20%3C!HS%3E%EA%B0%80%EC%9D%84%EC%97%AC%ED%96%89%3C!HE%3E","a0aa7dda-1a3b-455d-8d32-b1b9a23d5e00","93e5bce7-5557-4c51-8386-f7754839131d","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('9b65958c-c96b-4b89-8da1-f30d3f094feb');"> <img alt="중앙선 따라 떠나는 늦가을 간이역 여행" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=c027dd6b-c3d7-4a3c-9c1b-8488d84fa1eb"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('9b65958c-c96b-4b89-8da1-f30d3f094feb');"><em></em>중앙선 따라 떠나는 늦<!--HS-->가을<!--HE--> 간이역 <!--HS-->여행<!--HE--></a> </div> <div class="service"> <p>경기도 남양주시</p> <ul class="brandingIcon" id="branding_9b65958c-c96b-4b89-8da1-f30d3f094feb"> </ul> </div> <p class="tag_type"><span>#<em></em>간이역여행</span><span>#<em></em>감성여행</span><span>#<em></em><em>가을여행</em>지추천</span><span>#<em></em><em>가을여행</em></span><span>#<em></em>기차여행</span><span>#<em></em>간이역</span> </p></div><button class="btn_view" onclick='viewClick("9b65958c-c96b-4b89-8da1-f30d3f094feb")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("9b65958c-c96b-4b89-8da1-f30d3f094feb")'>즐겨찾기</a></li> <li class="btn_share" id="9b65958c-c96b-4b89-8da1-f30d3f094feb"><a href="javascript:" onclick='getShareInfo("%EC%A4%91%EC%95%99%EC%84%A0%20%EB%94%B0%EB%9D%BC%20%EB%96%A0%EB%82%98%EB%8A%94%20%EB%8A%A6%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%20%EA%B0%84%EC%9D%B4%EC%97%AD%20%3C!HS%3E%EC%97%AC%ED%96%89%3C!HE%3E","c027dd6b-c3d7-4a3c-9c1b-8488d84fa1eb","9b65958c-c96b-4b89-8da1-f30d3f094feb","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('bab274fb-1011-42e7-8d22-c466749accee');"> <img alt="[담양] 느림을 통해 더욱 풍성해지는 늦가을 여행&lt;br&gt; 슬로시티 창평" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=9d0ba758-d33f-4332-b766-5dc0bd8e6569"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('bab274fb-1011-42e7-8d22-c466749accee');"><em></em>[담양] 느림을 통해 더욱 풍성해지는 늦<!--HS-->가을<!--HE--> <!--HS-->여행<!--HE--><br/> 슬로시티 창평</a> </div> <div class="service"> <p>전라남도 담양군</p> <ul class="brandingIcon" id="branding_bab274fb-1011-42e7-8d22-c466749accee"> </ul> </div> <p class="tag_type"><span>#<em></em>전남담양</span><span>#<em></em>담양후산리은행나무</span><span>#<em></em>창평향교</span><span>#<em></em>한옥에서</span><span>#<em></em>양동호가옥</span><span>#<em></em>화순양참사댁</span><span>#<em></em>한국관광품질인증테마여행</span><span>#<em></em>품질인증콘텐츠</span> </p></div><button class="btn_view" onclick='viewClick("bab274fb-1011-42e7-8d22-c466749accee")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("bab274fb-1011-42e7-8d22-c466749accee")'>즐겨찾기</a></li> <li class="btn_share" id="bab274fb-1011-42e7-8d22-c466749accee"><a href="javascript:" onclick='getShareInfo("%5B%EB%8B%B4%EC%96%91%5D%20%EB%8A%90%EB%A6%BC%EC%9D%84%20%ED%86%B5%ED%95%B4%20%EB%8D%94%EC%9A%B1%20%ED%92%8D%EC%84%B1%ED%95%B4%EC%A7%80%EB%8A%94%20%EB%8A%A6%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%20%3C!HS%3E%EC%97%AC%ED%96%89%3C!HE%3E%3Cbr%3E%20%EC%8A%AC%EB%A1%9C%EC%8B%9C%ED%8B%B0%20%EC%B0%BD%ED%8F%89","9d0ba758-d33f-4332-b766-5dc0bd8e6569","bab274fb-1011-42e7-8d22-c466749accee","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('19a8891a-bb01-4f3b-8584-56d02941180e');"> <img alt="풍요로운 가을 들녘이 손짓하는 곳 &lt;br&gt;동정호 &amp; 형제봉" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=4e76c485-6cee-4c33-947e-02e1266bfb0e"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('19a8891a-bb01-4f3b-8584-56d02941180e');"><em></em>풍요로운 <!--HS-->가을<!--HE--> 들녘이 손짓하는 곳 <br/>동정호 &amp; 형제봉</a> </div> <div class="service"> <p>경상남도 하동군</p> <ul class="brandingIcon" id="branding_19a8891a-bb01-4f3b-8584-56d02941180e"> </ul> </div> <p class="tag_type"><span>#<em></em>2021가을시즌비대면안심관광지25선</span><span>#<em></em>2021비대면안심관광지</span><span>#<em></em>비대면안심관광지</span><span>#<em></em>비대면_안심관광지</span><span>#<em></em>가을_비대면관광지</span><span>#<em></em>하동여행</span><span>#<em></em>하동가볼만한곳</span><span>#<em></em>동정호</span><span>#<em></em>형제봉</span><span>#<em></em>자연과함께</span><span>#<em></em>경상권_비대면관광지</span><span>#<em></em>2022_추석_당일치기_여행</span> </p></div><button class="btn_view" onclick='viewClick("19a8891a-bb01-4f3b-8584-56d02941180e")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("19a8891a-bb01-4f3b-8584-56d02941180e")'>즐겨찾기</a></li> <li class="btn_share" id="19a8891a-bb01-4f3b-8584-56d02941180e"><a href="javascript:" onclick='getShareInfo("%ED%92%8D%EC%9A%94%EB%A1%9C%EC%9A%B4%20%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%20%EB%93%A4%EB%85%98%EC%9D%B4%20%EC%86%90%EC%A7%93%ED%95%98%EB%8A%94%20%EA%B3%B3%20%3Cbr%3E%EB%8F%99%EC%A0%95%ED%98%B8%20%26%20%ED%98%95%EC%A0%9C%EB%B4%89","4e76c485-6cee-4c33-947e-02e1266bfb0e","19a8891a-bb01-4f3b-8584-56d02941180e","304");'>공유하기</a></li> </ul></div></li><li><div class="photo"><a href="javascript:goSearchDetail('b2f0a3ad-acdf-4db2-b1aa-7ec742720701');"> <img alt="가을빛처럼 풍성한 책 마을 풍경, 완주 삼례책마을과 그림책미술관" src="https://cdn.visitkorea.or.kr/img/call?cmd=VIEW&amp;id=731c61c2-f54f-4409-834e-f89b1294af63"/> </a></div> <div class="area_txt"> <div class="tit"> <a href="javascript:goSearchDetail('b2f0a3ad-acdf-4db2-b1aa-7ec742720701');"><em></em><!--HS-->가을<!--HE-->빛처럼 풍성한 책 마을 풍경, 완주 삼례책마을과 그림책미술관</a> </div> <div class="service"> <p>전라북도 완주군</p> <ul class="brandingIcon" id="branding_b2f0a3ad-acdf-4db2-b1aa-7ec742720701"> </ul> </div> <p class="tag_type"><span>#<em></em>추천가볼만한곳</span><span>#<em></em>완주가볼만한곳</span><span>#<em></em>삼례책마을</span><span>#<em></em>그림책미술관</span><span>#<em></em>비비정</span><span>#<em></em>송광사</span><span>#<em></em>위봉산성</span><span>#<em></em>위봉폭포</span><span>#<em></em>대아수목원</span><span>#<em></em><em>가을여행</em></span><span>#<em></em>당일치기여행</span> </p></div><button class="btn_view" onclick='viewClick("b2f0a3ad-acdf-4db2-b1aa-7ec742720701")' title="열기" type="button">더보기</button><div class="pop_subMenu"> <ul> <li class="btn_far"><a href="javascript:" onclick='setFavoContent("b2f0a3ad-acdf-4db2-b1aa-7ec742720701")'>즐겨찾기</a></li> <li class="btn_share" id="b2f0a3ad-acdf-4db2-b1aa-7ec742720701"><a href="javascript:" onclick='getShareInfo("%3C!HS%3E%EA%B0%80%EC%9D%84%3C!HE%3E%EB%B9%9B%EC%B2%98%EB%9F%BC%20%ED%92%8D%EC%84%B1%ED%95%9C%20%EC%B1%85%20%EB%A7%88%EC%9D%84%20%ED%92%8D%EA%B2%BD%2C%20%EC%99%84%EC%A3%BC%20%EC%82%BC%EB%A1%80%EC%B1%85%EB%A7%88%EC%9D%84%EA%B3%BC%20%EA%B7%B8%EB%A6%BC%EC%B1%85%EB%AF%B8%EC%88%A0%EA%B4%80","731c61c2-f54f-4409-834e-f89b1294af63","b2f0a3ad-acdf-4db2-b1aa-7ec742720701","304");'>공유하기</a></li> </ul></div></li></ul>

In [524]:
no, no2, location2, contents2, tags2 = 1,[],[],[],[]
for i in content_list:
    try:
        contents = i.find('div','tit').get_text()
        location = i.find('div','service').get_text()
        tag = i.find('p', "tag_type").get_text()
        no2.append(no)
        location2.append(location.strip())
        contents2.append(contents.strip())
        tags2.append(tag.strip())
        no += 1
    except AttributeError as err:
        pass

In [526]:
no2

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [527]:
korea_trip = pd.DataFrame()
korea_trip['번호'] = no2
korea_trip['지역'] = location2
korea_trip['내용'] = contents2
korea_trip['태그'] = tags2

In [528]:
korea_trip

,번호,지역,내용,태그
0,1,경상남도 의령군,"[소도시 낭만 여행, 마이리틀시티] 9탄 때묻지 않은 자연을 품은 의령에서 맞이한 가을",#의령여행#의령가볼만한곳#소도시여행#가을여행#호국의병의숲#일붕사#의령구름다리#구름다...
1,2,전국,색깔별로 떠나는 가을 꽃 여행,#가을꽃여행#가을여행#꽃여행#단풍여행#갈대#댑싸리#코스모스#핑크뮬리#꽃무릇#칠면초#...
2,3,경상북도 영주시,"내게 온 영주와 떠나는 가을 랜선 여행, '내게 와, 영주!'",#영주여행#영주가볼만한곳#만수주조#발효체험학교#발효체험학교띄움#소백산꽃차이야기#체험...
3,4,,"9월 청청한 한가위, DMZ으로 떠나는 가을여행",#가을여행#DMZ#DMZ테마#DMZ테마여행
4,5,대구 달서구,"대구 도심 속 보석 같은 가을 여행지, 대명유수지와 달성습지",#2021가을시즌비대면안심관광지25선#2021비대면안심관광지#비대면안심관광지#비대면...
5,6,경기도 이천시,2000배 더 즐거운 이천 가을여행,#이천여행#이천가볼만한곳#당일치기여행#예스파크#시몬스테라스#티하우스에덴#설봉호수#별...
6,7,경기도 남양주시,중앙선 따라 떠나는 늦가을 간이역 여행,#간이역여행#감성여행#가을여행지추천#가을여행#기차여행#간이역
7,8,전라남도 담양군,[담양] 느림을 통해 더욱 풍성해지는 늦가을 여행 슬로시티 창평,#전남담양#담양후산리은행나무#창평향교#한옥에서#양동호가옥#화순양참사댁#한국관광품질인...
8,9,경상남도 하동군,풍요로운 가을 들녘이 손짓하는 곳 동정호 & 형제봉,#2021가을시즌비대면안심관광지25선#2021비대면안심관광지#비대면안심관광지#비대면...
9,10,전라북도 완주군,"가을빛처럼 풍성한 책 마을 풍경, 완주 삼례책마을과 그림책미술관",#추천가볼만한곳#완주가볼만한곳#삼례책마을#그림책미술관#비비정#송광사#위봉산성#위봉폭...

In [530]:
korea_trip.set_index('번호', inplace=True)

In [534]:
korea_trip.loc[5 ,'지역'] = 'DMZ'

In [ ]:
korea_trip